[
    {
        "id": 1,
        "name": "Elementary Mathematics I",
        "code": "MTH 101",
        "outline": "Number systems, Indices, Surds and Logarithms, Polynomials, Remainder and factor theorem, Polynomial equations, Partial fractions, Fields, Ordered fields. Inequalities. Mathematical induction. Permutations and combinations. Binominal theorem. Sequences and series. The quadratic equation and function. Relation between the roots and the coefficients. Complex numbers. Addition, subtraction, multiplication and division. Argand diagram. De- Moivre theorem, n-th roots of complex numbers. Elementary set theory. Venn diagrams and application of De-Morgan's laws. Trigonometry. Elementary properties of basic trigonometric functions. Addition formulae and basic identities. Sine and cosine formulae. Half angle formulae. Area of a triangle. Solution of trigonometric equations. Inverse trigonometric functions. Function, Concept and notation. Examples composition, Exponential and logarithmic functions. Graphs and properties. Limits and continuity. Techniques for finding limits. The derivative. Calculations from first principles, Techniques of differentiation. Chain rule. Higher order derivatives. Extreme problems. Mean Value Theorem. Applications. Indeterminate forms and L'Hopital's rule. Taylor's and Maclaurin's series. Curve sketching. Integration as the inverse of differentiation, as area, as limit of finite sum. Applications.",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 4,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 2,
        "name": "General Chemistry I",
        "code": "CHM 101",
        "outline": "Chemical reaction, equations and stoichiometry, Atomic structure and the periodic classification of elements. Electronic theory of atoms, Radioactivity, Ionic and covalent bonds, Solids and their structure. Dipole interactions and its effect on physical p",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 4,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 3,
        "name": "General Physics I",
        "code": "PHY 101",
        "outline": "Mechanic: Space and Time, Units and dimensions; Vectors kinematics, Newton’s law; Galilean invariance; Statics and dynamics of particles; Universal Gravitation; Work and potential energy, conservation of energy and momentum, Rigid bodies, Elasticity; Hooke's law, Young's, Shear and bulk moduli. Fluid mechanics; Hydrostatics, pressure, buoyance, Archimedes’ principles, surface tension, adhesion, cohesion, capillarity, drops and bubbles. Thermal Physics: thermal properties, including elementary thermodynamics and kinetic theory. The laboratory course emphasized qualitative measurements, the treatment of error measurements and graphical of experimental techniques will be employed.",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 4,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 4,
        "name": "Biology I",
        "code": "BIO 101",
        "outline": "Cell structures and Organization, plant and animal cells. Functions of cellular organelles; diversity, characteristics of living things, General reproduction, mitosis and meiosis, abnormalities associated with gene crossing, heredity and evolution. Concep",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 5,
        "name": "Workshop Practice I",
        "code": "ENG 101",
        "outline": "General: Use of engineeering measuring instruments Calipers e.g. Vernier Calipers; Gauges e.g. Micrometer Screw gauge and other devices. Introduction to hand tools, proficiecy in the use of wood planer, Hand Saw, Sanders and Pottern Making. Sheet Metal Wo",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 6,
        "name": "Engineering Drawing I",
        "code": "ENG 103",
        "outline": "Introduction to the engineering tools. Planning and layout of engineering drawing. Engineering drawing concept. Introduction to Dimensioning - types; Dimensioning of circles, holes, radii, tolerancing. Descriptive Geometry. Freehand sketching. Introduction to Drawing\/Drafting Software and CAD Basic tools: Orthographic multi view projection. Construction of plane shapes using CAD construction techniques. Presentation of data result using charts, graphs etc. by appropriate computer software. Further dimensioning addition of dimensions to drawing using CAD.",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 7,
        "name": "Use of English I",
        "code": "GST 101",
        "outline": "Library orientation, study aids through dictionary practice, vocabulary development techniques, reading and comprehension techniques, listening and note-taking techniques outlining and summarizing, dealing with examination questions.",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 8,
        "name": "Humanities",
        "code": "GST 103",
        "outline": "Introduction to humanities, definition and rationale. Role literature in the humanities aspects of the contemporary African Novel; significant examples of African\/Western poetry; dramatic art role and relevance in modem Nigeria with practical. Demonstrations\/performances. Roles of philosophy in the humanities, man and his quest for certainty; materialism, idealism, the meaning and significance of selected concepts-freedom, responsibility, obligation, the \"good life\", art beauty; values - relative and non-relative; inductive arguments and scientific reasoning. Exposure to African History - its role and relevance, African art and music - its history and development, Religion and the meaning of life-past, persent and future.",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 9,
        "name": "Use of Igbo I",
        "code": "IGB 101",
        "outline": "This course will equip the students with the basic skills, listening, speaking, reading and writing in the approved 1961 orthography as the basics for standard Igbo. Nkowa banyere ndi Igbo, Mkpuruedemede Igbo (Otografi onwu), Nkejiasusu Igbo, Akaraedemede, Nkebiokwu Igbo, Nkebiahiri Igbo, Ahiriokwu Igbo, Udi ahiriokwu di iche iche, Asusu Igbo dika Asusu SVO, Nkejiokwu Igbo, Ndakorita udaume, Udaolu, Ntughari, Edemede (kompozishon), Edemleta, Atumatu okwu, Aghota azaa (Aguozaa), Nchikota, Ekwumekwu n'asusu Igbo, Ikwu okwu n'oha, Nsupe n' Igbo.",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 10,
        "name": "Use of French I",
        "code": "FRN 101",
        "outline": "This course will introduce the students to the basics of French Language such as greeting in French, French alphabets, vowels, pronunciation and accents. The students will also learn the components of French grammar as the article, verb, etc.",
        "mandatory": 1,
        "reference_id": 101,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 11,
        "name": "Use of Igbo II",
        "code": "IGB 102",
        "outline": "This course will expose students to various aspects of human life among the Igbos as follows: Igbo world-view, Igbo culture and history, Igbo in a world of arts and civilization. It will also provide a good exposure in the area of Igbo literature which embodies the totality of the Igbo World-view, including their social and cultural perspectives, their aspirations and amenities, as some contemporary texts will be incorporated in the study. Akuko banyere ndi Igbo na mmalite ndu ha, Ekele na nsopuru n'ala Igbo, Ndi Igbo na nnabata ndi Obia, Ewumewu ndi Igbo, Ewumewu nkwalite aku na uba, Ewumewu okpukprechi, Ewumewu ahiuke, Ewumewu okwu ochichi, Mmekorita ndi Igbo na ndi agbataobi ha, Akuko okike, Aru, Onwu nan du, Akwamozu, Okwukwe di iche iche ndi Igbo nwere, Agumagu Igbo, Ngalaba agumagu Igbo na ejirimara ha, Akparamagwa na uru agumagu onu na agumagu ederede, nkowa ngalaba agumagu di iche, Njem nlegharianya.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 12,
        "name": "Use of French II",
        "code": "FRN 102",
        "outline": "Here, the students will be drilled in French grammar proper, dialogue and other oral exercises. The students will also be introduced into reading, starting with France Afrique book 1. At the end of this course, the students should be able to speak basic French and be able to tell time in French.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 13,
        "name": "Elementary Mathematics II",
        "code": "MTH 102",
        "outline": "Transcendental functions. Inverse junctions. Logarithmic improper integrals, First-order equations with variable separable. First order linear equations. Second order homogenous equations with constant coefficients. Applications. Plane analytic geometry. Rectangular Cartesian co-ordinates. Distance two points. Straight line. Loci. The circle, parabola, ellipse and hyperbola. Second degree curves. Plane polar coordinates. Vectors: Vector addition and multiplications. Products of three or more vectors. Vector and their derivatives. Velocity and Acceleration. Matrix algebra. Addition and multiplications. Transpose. Determinants. Inverse oi non-singular matrices. Crammer's rule and application to the solution of linear equations. (Examples should be limited to m x n matrices where m=3, n=3). Transformations of the plane. Translation, reflection, rotation, enlargement, shear, composition of transformations. invariant points and lines.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 4,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 14,
        "name": "General Physics II",
        "code": "PHY 102",
        "outline": "Electricity: Electrostatics, Charge and matter, the electric field, Gauss’s law, electric potential, capacitors and dielectrics. Current electricity, Current and resistance, Ohm’s Law, electromotive force and circuits, RC circuits. Magnetism: Magnestatics, the magnetic field, Ampere’s Law, Faraday’s Law of induction, LR circuits. Magnetic properties of matter. Sound and Optical Properties. The laboratory course emphasized qualitative measurements, the treatment of error measurements and graphical analysis. A variety of experimental techniques will be employed.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 4,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 15,
        "name": "General Chemistry II",
        "code": "CHM 102",
        "outline": "Organic formulae and structure. Homology and Isomerism. Concepts of hybridization. Survey of reactions of functional groups in Aliphatic and Aromatic compounds. Introduction to the chemistry of alkalines. Alkenes, Alkynes, Halokanes Alkanals, Esters, Amines, Aldehydes, Ketones, Carboxylic acids and their derivatives.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 4,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 16,
        "name": "Workshop Practice II",
        "code": "ENG 102",
        "outline": "Industrial safety; Behaviour analysis safety consciousness. Survey of sources of common accidents. Accidents prevention and control. Machine-shop work: Lethe-work: Instruction of metal working process. Shaping, milling, grinding, drilling and metal spinning etc. Design of simple jigs and fixtures. Automobile diagnosis and repairs. Electrical Workshop Practice: Convention and application of colours codes and sign etc. Use of the tools, machines and conductors.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 17,
        "name": "Engineering Drawing II",
        "code": "ENG 104",
        "outline": "Connections in engineering drawing. Introduction to IS code of drawing. Conics and engineering curves ellipse, parabola, hyperbola, cycloid, trochoid, involutes. Projection on auxiliary planes and solids. (cube, prism, pyramid, cylinder, core and sphere), projection on auxiliary planes. Isometric projection. Introduction to section drawing and use of CAD construction techniques. Development and intersection of surfaces. Detail drawing with the addition of machine and surface texture symbol. Simple assembly drawing with suitable fits and part list and introduction to limits and tolerances. Screw thread, fasteners and springs including keys and key ways.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": true,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 18,
        "name": "Use of English II",
        "code": "GST 102",
        "outline": "Second stage library work with emphasis on effective search techniques, paragraph development, essay writing principles and practice, term paper writing, technical report writing, business letter writing, referencing and documentation, grammar and mechanics.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 19,
        "name": "Science, Technology and Society",
        "code": "GST 110",
        "outline": "The scientific evolution of man-science, need, history, classifications, and modern scientific methods; science and man's environment Terrestrial and Cosmic Life; harnessing science - climate and vegetation. Production, processing, conservation, distribution; energy resources solar, thermal, nuclear energy - fossil fuels, estimates of energy reserves in Nigeria.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 20,
        "name": "Social Science I",
        "code": "GST 108",
        "outline": "This covers the nature and scope of politics and economics. From the basic concepts in public investment and economic infrastructures to fiscal federalism and revenue allocation. A global perspective of economics; economic systems and development, nations' economics, international trade and economic development; Balance of payments, commercial policies of Nigeria and other developing countries. Economic integration; state and structure of economics of ECOWAS countries, the ECA and countries, the ECA and economic co-operation in Africa. Foreign aid and investments: the multinational corporations, technological dependence. Global interdependence and the New International Economic Order. World economic crises, energy and OPEC, food storages and armament.",
        "mandatory": 1,
        "reference_id": 102,
        "semester": "RAIN",
        "status": "active",
        "level": "100",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 21,
        "name": "Computer and Applications I",
        "code": "CSC 201",
        "outline": "The discipline of computer science. Evolution of computer systems, Classification of computers. Computer hardware: Functional components, Modern input\/output units. Computer software: operating system: operating system - UNIX, Windows versions, Linux - Ubuntu, Kali, Red Hat, etc; Application packages: Word processing, Database (e.g, Oracle, MySQL, PostgreSQL, etc), Spreadsheet\/ Statistical packages (e.g, Ms Excel, SPSS), Project Management, Designs\/ Graphics CAD, Coral Draw, Photoshop, etc. Data Processing Systems, Data representation in digital computers. Number systems. Binary number representation. Unsigned addition and subtraction. One's and two's complement. Signed magnitude and excess radix number representations. Introduction to computer network and the Internet. Modern trends in computing: Smart Computing and Intelligent Systems, Internet of Things (IoT) and Machine learning, Virtual reality (VR), Cognitive technology, Touch Screen Technology, Computer Security (Benefits and Challenges), Ubiquitous computing, etc. Programming Language Translators - Assembler, Interpreter, Compiler: NetBeans, Visual Studio, JCreator, Web Translator: Adobe CS6, etc. Program Development Techniques: Pseudocode, Flowcharts and Algorithms; Computer programming in recent versions of Visual BASIC\/C\/ C++\/Java and Python.",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": true,
        "units": 4,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 22,
        "name": "Fundamentals of Cyber Security I",
        "code": "CSC 203",
        "outline": "Provides the overview of the introductory topics of cyber security. Topics including basic concepts of Confidentiality, Integrity, Availability, Authentication, Access Control, Non-Repudiation of Fault-tolerant methodologies for implementing security, security policies, best current practices, testing security, and incident response, risk management, disaster recovery, access control. Basic cryptography and software application vulnerability.",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 23,
        "name": "Mathematical Methods I",
        "code": "MTH 201",
        "outline": "Function of two or more variables. Limits and continuity, partial derivatives, directional derivatives, tangent plane and normal line. Gradient, chain rule. Total differential, implicit functions, Jacobians, inverse functions, Maxima and minima, Logrange multipliers. Higher order derivatives, the Laplacian, second derivative test for maxima and minima. Exact differentials. Derivatives of integrals, Taylor’s theorem, multiple integrals. Calculation of areas, volumes, centres of mass. Moment of inertia and etc, infinite sequences and series. Absolute and conditional convergence. Power series. Prerequisite: MTH 101 & MTH 102 ",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 24,
        "name": "Introduction to Statistics and Probability",
        "code": "STA 211",
        "outline": "Frequency distributions, measure of location and dispersion in simple and grouped data. Laws of probability. The binomial, Poisson and normal distributions. Estimation and tests of hypothesis. Analysis of variance and covariance, simple regression and correlation, contingency tables and 2. descriptive methods- stem and leaf charts. Graphical Displays- Box and Whisker plots. Application. Pre-requisites: MTH 101 & MTH 102.",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 25,
        "name": "Applied Electricity I",
        "code": "PHY 201",
        "outline": "Electrical circuit theory: Dc and Ac circuit analysis. Magnetic circuit: magnetomotive force, magnetic flux and reluctance, relative magnetic permeability and susceptibility. Introduction to electrical machines: Dc generator; Dc motor; polyphase systems; transformers, electric power distribution. Electric lamps and illumination. Galvanometers, ammeter and voltmeters.",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 26,
        "name": "Workshop Practice III",
        "code": "ENG 201",
        "outline": "Introduction to Manufacturing Technology. Basic Foundry Technology: Sand testing, mixing of sands, preparation of moulds. Pattern making- solid, split, sweep patterns; hosting gates and risers. Melting and pouring of metals, solidification, casting of simple shapes using sand moulds, permanent moulds and expendable polystyrene. Casting defects. Joining: Design of welded joints, stress analysis, types of joints e.g. T. joints, BUTT joint, Corner joints (Cap joints etc), soldering, and brazing, adhesive joints. Fusion welds-e.g manual metal arc, TIG, SAW, SPOT, Etc. Edge preparation, surface cladding, etc. Strength and toughness of welded joints, Laser welding, radio frequency (RF) welding. Pre-requisites: ENG 101 and ENG 102.",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": true,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 27,
        "name": "Social Sciences II",
        "code": "GST 201",
        "outline": "Concept and meaning of development; traditional Africa's geographical and ethnographical review, family structure, kinship system, socio-economic pre-occupations, political systems, art and music, modes of communication etc. African and processes of modernization-education, writing and press, urbanization and social change, modern trends in art and aesthetics, nationalism and cultural revival, mass media and national development.",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 28,
        "name": "Elementary Differential Equation",
        "code": "MTH 203",
        "outline": "Derivation of equation from physics, chemistry, biology, geometry and etc. first order equations. Applications of first order equations. Second order linear equations. Fundamental solutions. Linear dependence and independence. Wronskian. Properties of solutions of linear equations. Method of undetermined coefficients and variation of parameters. Applications of second order linear equations. General theory of n-th order linear equations. Laplace transforms. Convolution. Solution of initial-value problems by Laplace transforms method. Difference equations. Pre-requisites: MTH 101 & MTH 102.",
        "mandatory": 1,
        "reference_id": 201,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 29,
        "name": "Computer and Applications II",
        "code": "CSC 202",
        "outline": "Application packages: Word processing, Spreadsheet, Presentation package, Statistical packages. Internet Applications, and Database Management System. Software Tools involved: SPSS, MATLAB, OCTAVE, Oracle, Simulink, AutoCAD, ArchCAD, Latex, etc. Computer problem-solving methods: Role of algorithms in problem-solving; Concepts and properties of algorithms; Implementation strategies; Development of flowcharts and pseudocodes; Program objects; Implementation of algorithms in a programming language such as Visual Basic, Java, C\/C++.",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 30,
        "name": "Computer Architechure and Organisation I",
        "code": "CIT 204",
        "outline": "Review of computer systems basic structure and types. Differences between computer architecture and computer organization. Review of Computer operation, fetch and execute cycle, interrupts, stack operations. Architecture types: Von Neumann, Multicore, Multiprocessor systems. Instruction Set Architecture types: CISC, RISC, VLIW, EPIC architectures. Review of computer hardware system components; CPU, Memory, I\/O Systems. Microprocessors, internal architecture and system components; types of microprocessors. Memory types: semiconductor, optical and magnetic memories, standards, memory hierarchy. I\/O Systems design and types. Study of microcomputer system organization and operation, bus architecture and standards. Hardware control and micro programmed control. Direct Memory Access (DMA) and interrupt systems. Computer arithmetic and logic. Boolean Algebra and Logic Gates. Combinational and Sequential circuits design and applications. Decoders, multiplexers, adders, Registers, Counters, etc. Assembly language programming, addressing modes. Design assignments. ",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 31,
        "name": "Computer Programming I",
        "code": "CIT 202",
        "outline": "Problem Solving Process: Problem Identification, Formal Representation of the Problem, Identification of Inputs and Outputs to the Problem. Concept and Properties of Algorithms. Algorithm Development using Pseudocodes and Flow Charts. Algorithm Implementation: Choice of Programming Language (Python, Visual Basic, Java, C\/C++), Program Design and Coding Styles (Procedural, Modular and Object Oriented Programming). Data Types, Keywords, Operators, Standard Library functions, Data Structures, Control Structures (Sequence, Selection and Repetition), String Processing, File Processing, Parameter Passing Techniques (Passing by Value and Passing by Reference), Concept of Binding (Static and Dynamic Binding), Storage Allocation Techniques. Program Debugging, Program Testing and Documentation. Programming laboratory exercises.",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 32,
        "name": "Mathematical Methods II",
        "code": "MTH 202",
        "outline": "Vectors. Products of vectors. Equations of lines and planes. Vector spaces. Linear dependence and independence. Basis and dimension. Linear transformations, matrices. Inverse of matrix. Determinants. Operations an matrices. Rank at a matrix , crammer's rule. Eigenvalues and eigenvectors. Similarities to diagonal matrices. Pre-requisites: MTH 101 & MTH I02.",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 33,
        "name": "Fundamentals of Cyber Security III",
        "code": "CSC 204",
        "outline": "Operating system protection mechanisms, intrusion detection systems, formal models of security, cryptography, Stenography, network and distributed system security, denial of service (and other) attack strategies, worms, viruses, transfer of funds\/value across networks, electronic voting, secure applications, homeland cyber security policy, and government regulation of information technology.",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 34,
        "name": "Introduction to Database Design and Applications",
        "code": "CSC 208",
        "outline": "Databases and database users, File Systems and DBMS, database applications, Database concepts; models, schemas, instances. Centralized and Client\/ Server Architectures for DBMSs, Classification of Database Management Systems, relational database models, Basic SQL, ER, UML models, role of information Systems in Organizations, Database Design and Implementation Process using Microsoft Access.",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 35,
        "name": "Numerical Methods",
        "code": "MTH 222",
        "outline": "Solution of algebraic and transcendental equations. Curve fitting, Lagrange and Aithens interpolating polynomials. Errors. Difference calculus. Newton forward and backward difference formulae. Approximation of functions. Numerical differentiation and integration. Numerical solution of systems of linear equations. Numerical methods for differential equations. Pre-requisites: MTH 101 & MΤΗ 102.",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 36,
        "name": "Probability and Random Variables",
        "code": "STA 212",
        "outline": "Probability spaces, random variables, distribution function, expected value. Examples of discrete and continuous distributions. Mean, variance, moments and generating functions. Conditional probability, Bayes theorem, joint distributions of transformed random variables. Chebychev's inequality, law of large numbers and central limit theorem, multivariate normal distribution, co-variance and correlation. Pre-requisites: MTH 101 & MTH 102.",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 37,
        "name": "SIWES",
        "code": "SIW 200",
        "outline": "200 Level SIWES",
        "mandatory": 1,
        "reference_id": 202,
        "semester": "RAIN",
        "status": "active",
        "level": "200",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 38,
        "name": "Operating Systems I",
        "code": "CIT 301",
        "outline": "Review of historical development of Operating systems, operating system concepts and structure. Basic components of a modern operating system; Operating system kernel, Processor management: Concurrency control, Process and inter-process communication, Process synchronization, Deadlocks, Memory management, Device management, Files systems, protection and security. Case studies of the features of popular operating systems such as MS Windows, Unix, Linux, etc. Design features of: single-user, multi-user, network, distributed, real-time, and embedded operating systems. Students will learn the following: installation and maintenance of Windows and Unix - like operating systems such as Linux; how to write programs that accomplishes part of their operation through interaction with the operating system; effective use of the operating system tools for writing shell scripts and batch files, pattern matching, editing, micro processing, data analysis and text processing. Prerequisite: CSC201 or CSC202",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 39,
        "name": "System Analysis and Design",
        "code": "CIT 303",
        "outline": "System concepts; System components, Introduction to SSAD. System development life cycle: Project planning, Requirements specifications, Analysis, Preliminary investigation: Fact gathering & techniques. Data delivery, Data flow diagrams. Process description; System design: Automated design tools, Data modelling, Structure charts, I\/O and Report forms designs, security; Data Dictionary, Software design & coding System implementation: Software development; Hardware acquisition, System integration and testing; Cost and time estimation and management of system development, System maintenance; Case studies and projects.",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 40,
        "name": "Computer Systems Laboratory",
        "code": "CSC 303",
        "outline": "Basic Computer Hardware: Input\/Output Devices, Internal components of the system Units (Motherboard, Memory Banks, Expansion Slots, etc), Hardware components interconnections; Computer Maintenance, cloning and assembly. Computer Interfaces and Cables, Computer Networks and Data communications devices; Computer system security, Data protection techniques, Practical laboratory experiences with commonly used application software such as word processors, spreadsheets, database management systems, statistical packages, project management, Decision support systems, Computer graphics, Web design tools, Internet facilities. Pre-requisites: CSC 201 or CSC 202",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 41,
        "name": "Data Structures and Algorithms",
        "code": "CSC 305",
        "outline": "Abstract data types, Record structure, File Structure, Arrays\/Lists, Linked Lists, Stocks, Queues, Trees, Graphs, and: Algorithms for their implementation and operations; Algorithms for finding paths and spanning trees. Design and analysis of efficient algorithms for searching, internal\/external sorting, and merging; Algorithms for dynamic storage allocation, garbage collection and compaction; Integration of data structures, and searching sorting\/merging methods and memory media into a simple database management system. Pre-requisite: CSC 201 or CSC 202",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 42,
        "name": "Structured Programming",
        "code": "CSC 307",
        "outline": "Structured Programming elements; Programming Abstractions; Structured design principles; Modular Programming; Choice of Data Structures; Structured program design techniques and tools; Structured Object-oriented Programming, Stepwise refinement; Advanced features of Structured Programming Language such as C\/C++, Java, etc.",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 43,
        "name": "Discrete Structures",
        "code": "CSC 309",
        "outline": "Basic Set Theory; Basic definitions; Relations; Equivalence; Relation Partition; Ordered Sets; Boolean Algebra and Lattices; Logic; Graph Theory; Directed and Undirected graphs; Graph Isomorphism; Basic Graph Theorems; Matrices: Integer and Real Matrices; Boolean Matrices; Matrix Norms; Path Matrices; Adjacency Vectors\/Matrices; Path Adjacency; Numerical and Boolean Adjacency Matrices; Applications to counting; Discrete Probability Generating Functions. Pre-requisite: MTH 201 or MTH 202",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 44,
        "name": "Applied Electronics",
        "code": "PHY 303",
        "outline": "Semiconductor devices: Semiconductors, diodes, transistors, integrated circuits. Diodes: characteristics curve; forward and reverse bias; rectification and filtering: zener diode; diode voltage regulators. Transistors: Bi-polor and field Effect transistors; characteristics curves, active and cut-off regions. Transistor Amplifiers, bi-polar and FET Amplifiers, biasing and load lines. Operational Amplifiers: Negative feedback; analog computation. Positive feedback; Oscillators, waveform generators. Pre-requisites: PHY 201.",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 45,
        "name": "Introduction to Software Engineering",
        "code": "CIT 305",
        "outline": "Introduction to software techniques, methodologies and process models, specification modelling, requirements analysis and definition, agile software development, software design, quality assurance, testing, development tools and environments and software engineering, ethics, introduction to software management, dependability and security assurance.",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 1,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 46,
        "name": "Introduction to Entrepreneurship & Innovation I",
        "code": "ENS 301",
        "outline": "Development entrepreneurship\/entrepreneurships, The Nigerian entrepreneurial environment, creativity and intellectual rights, technological and entrepreneurship, Innovation: theories and management, family business and succession planning, women entrepreneurship, social entrepreneurship, business opportunity set and evaluation, introduction to business strategy, introduction to business ethics and corporate governance, relationship between scientiﬁc research innovation and products, product invention, timeliness and processes.",
        "mandatory": 1,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 47,
        "name": "Real Analysis I",
        "code": "MTH 303",
        "outline": "Sets. Functions. Mathematical induction. Properties of real numbers. Cauchy convergence criterion. Test for convergence. Limits and continuity of functions. Uniform continuity of functions. Uniform continuity and approximations. The derivatives. Mean value theorem. L'Hopitals rule. Taylor's theorem. Convex functions. Applications. Pre requisite MTH 201.",
        "mandatory": 0,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 48,
        "name": "Introduction to Statistical Inference",
        "code": "STA 311",
        "outline": "Point estimation by moments and maximum likelihood methods. Properties of point estimators: unbiasedness, sufficiency, completeness. Uniformly minimum variance unbiasedness. Rao-Crammer inequality, consistency, efficiency, test asymptotic normality. Confidence intervals and regions. General method of finding a confidence bound, large sample confidence intervals. Bayesian method of estimation. Hypothesis testing. Neymann-pearson theorem. Comparison of populations by parametric methods. Pre requisite STA 212.",
        "mandatory": 0,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 49,
        "name": "Statistical Computing",
        "code": "CSC 311",
        "outline": "Explain statistical packages. Problems associated with analysis of stochastic problems and statistical data analysis by Applied Linear models; computational aspects of multiple regression model, programming for statistical problems and statistical packages. Design and analysis of sampling surveys: statistical data compression, 2D, 3D frequency tables. Point and interval estimation; Test of significance; Test of Hypothesis; Analysis of categorical data; Model validation; X2 test, probability, Multiple regressions, analysis of variance, Statistical control, use of statistical packages.",
        "mandatory": 0,
        "reference_id": 301,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 50,
        "name": "Operating System II",
        "code": "CSC 310",
        "outline": "OS design approaches: Layered, Kernel and Virtual machine; File systems and management; I\/O management: Goals of I\/O software Device controllers, Direct Memory Access; Disk hardware, Disk Arm Scheduling algorithms; Memory-mapped Terminals, Advanced memory management schemes and algorithms: Caching; Virtual memory; Processor management and process scheduling; Concurrency control; Deadlock detection and prevention algorithms; Interrupt handlers; Error handling, Case study, Unix, Linux, Windows, Real-time operating systems.",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 51,
        "name": "Computer Architecture and Organization II",
        "code": "CSC 302",
        "outline": "Review of CPU organization and micro-architectural level designs; Instruction set designs, register transfer, CISC and RISC design principles. Instruction set architecture: instruction types, registers, and memory addressing modes. Bus organization and data-path design. Hardwired and micro-programmed control. Control unit design: Internal control signals. ALU operation. ALU design: Integer\/floating point data representations: Addition, multiplication and division algorithms and implementation. Floating point processors; BCD arithmetic. Memory systerns and their characteristics; Technology of magnetic recording, optical, and semi-conductor memories. Peripheral device designs. Architecture types: Von Neumann architecture, Very Long Instruction Word (VLIW) and Explicitly Parallel Instruction Computing (EPIC) architectures; Multiprocessor systems; Instruction pipelining; Super-scaler and super-pipeline architectures. Survey of real computers and microprocessors. Performance Evaluation: metrics and calculation, performance equations, Amdahl's law. Case studies of typical recent architectural designs. Pre-requisite: CSC 201 or CSC 202",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 52,
        "name": "Database Management Systems and Design I",
        "code": "CIT 304",
        "outline": "Organization of information for storage and retrieval; Concepts of fields, records, files, and databases. Data storage devices and their characteristics, File organization and access methods: serial, sequential, indexed, multi- indexed\/inverted, indexed-sequential; Relative file organization and hashing algorithm; Factors influencing file organization: Record blocking factors for tape and disk files; Classification of files: master, transaction, history\/ trends, Multimedia files; Data verification and validation methods; Records\/ files creation and manipulation constructs available in modern programming languages and DBMS: Information and File security, Concurrency and data integrity, Data file processing modes: batch, online, real-time, Report generation. Case studies, designs and algorithms. Pre-requisite: CSC 201 or CSC 202.",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 53,
        "name": "Computer Programming II",
        "code": "CIT 302",
        "outline": "Review of Data Types and Structure; Numeric and String Types, Arrays, Pointers, etc. Program environments and operating systems facilities available to the programmer; Implementation of algorithms for arrays handling, enumerated data types, strings, searching, sorting, linked lists, recursion; Input\/output file access and updating; Principles of Good Programming; Concepts of structured, modular and defensive programming; Object Orientation re- visited, Java IDE (Creating, Saving and Opening of Program Files); Class and Methods re-visited; Core concepts in Java Programming: Inputs\/Outputs, Variables\/Constants, Iteration, Decision, Operations, Data Manipulations; Advanced Concepts: Inheritance, Polymorphism, Encapsulation, exception Handling; Java I\/O, File Manipulation. Use of modern programming tools in implementing business problems. Programming laboratory exercises and projects. Other Programming languages; C++, HTML and XML, and commonly used software packages, Oracle suites, ASP. Net, IIS and Apache.",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 54,
        "name": "Web Design and Programming I",
        "code": "CIT 306",
        "outline": "Introduction to the www. Internet hardware infrastructures; Internet Software Systems; Review of the ISO Interconnectivity Model; Internet information communication infrastructures; Internet software systems; Internet-based system architectures; Protocols design; Organization WWW databases; HTML-document Structure images, links, maps, tables frames, forms, protocols and server technology- HTTP, TCP\/IP, MIME, URLs CGI JavaScript- syntax, DOM, forms processing, common tasks style sheets- fundamentals, CSS formatting, CSS positioning, web design and usability, Introduction to XML-syntax, DTDs XSL, XHTML, Multimedia audio, video animation, Multimedia server and protocol technology, Web design and development tools-Editors; Dreamweaver, Macromedia Flash, HTML, Java Script, PHP, CGI, etc; Business-to-business websites; Website management tools; Web data security issues: threat detection and data protection techniques. Mini- projects on website analysis, design, implementation, and testing issues using client-server architecture",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 55,
        "name": "Compiler Construction I",
        "code": "CSC 304",
        "outline": "Review of Compilers, Assemblers and Interpreters; Basic structure of a compiler; Phases of compilation: Lexical analysis; Syntax analysis, semantic analysis code generation, Code optimization; Grammars and languages; Ambiguity in grammar; Parsing techniques; Symbol tables; Storage administration; Error handling; Intermediate codes; Optimization and code generation; Deterministic and non-deterministic finite automata; Compiler- compilers and translator writing systems. LEX and YACC.",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 56,
        "name": "Assembly and Machine Language Programming",
        "code": "CSC 306",
        "outline": "Assembler concepts: Assembler structure; Data-word definition, Instructions mnemonics and syntax, Assembler directives and commands, Assembly programs execution; Internal registers, Error flags and messages. Literals, Instruction set and instruction formats. Operand addressing mode; symbolic addresses; register transfer languages, machine cycles; MIPS architecture\/ Intel processor assembly programming; Numeric conversions, String processing; Macros, I\/O services; Program control. Fetch-Execute cycle I\/O operations, Interfacing assembly language programs to high-level language programs; Machine instructions and microprogramming; Case studies of simple machine language programming: ROMBIOS, NetBIOS, I\/O control programs, etc.",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 57,
        "name": "Introduction to Theory of Computing",
        "code": "CSC 308",
        "outline": "Basics of formal languages with applications to syntax of programming languages; Models of computers including finite automata, transducers, and Turing machines; Unsolvable problems and their relevance to the semantics of programming languages; Concept of computational complexity including NP-Completeness;",
        "mandatory": 0,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 58,
        "name": "Real Analysis II",
        "code": "MTH 304",
        "outline": "The Riemann integral. Fundamental theorem of calculus. Improper integrals, Riemann-Stielties integral. Sequences and series of functions. Point wise and uniform convergence. Functions of several variables. Limits and continuity. The derivative in RP. Chain rule. Higher order derivatives. Extremum problems. Integration of functions of several variables. Pre requisite MTH 201.",
        "mandatory": 0,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 59,
        "name": "Object-oriented Programming",
        "code": "CSC 312",
        "outline": "Introduction to object-oriented programming, Basic object-oriented concepts: Data abstraction, Encapsulation, Classes, Objects, Messages, Methods, Inheritance, Polymorphism, Aggregation; OO analysis and design using UML patterns and frameworks, components and component object models; Operators and overloading; Structured OO program; Introduction to C++, Java and their library of functions; Programming assignments and projects using C++ and Java.",
        "mandatory": 0,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 60,
        "name": "Introduction to Entrepreneurship & Innovation II",
        "code": "ENS 302",
        "outline": "Concept of business and new value creation, introduction to theories of growth, Business strategy, sources of capital, Principles of marketing, Business ethics and social responsibility, Opportunity sets and expansion considerations (E-commerce, E-Business, E-Trade), The Scientific\/Engineer as an entrepreneur; opportunities and challenges, Managing transition (start up, growth), Basic accounting literacy, Feasibility and viability studies including issues in cash flow analysis, Crafting business plans Corporate governance and change management.",
        "mandatory": 1,
        "reference_id": 302,
        "semester": "RAIN",
        "status": "active",
        "level": "300",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 61,
        "name": "Survey of Programming Languages",
        "code": "CSC 401",
        "outline": "Overview of programming languages: History of programming languages; Brief survey of programming paradigms (procedural, object-oriented, functional, declarative, scripting languages), The effects of scale on programming methodology, Language description: Syntactic structure (Expression notation, Abstract syntax tree, Lexical syntax, Grammar), Language Semantics (Formal, Informal, Denotational, Axiomatic, Operational semantics). Types declarations: Overview of type-checking, Garbage collection; Abstraction mechanisms; procedures, function and iterations as abstraction mechanisms, parameterized types, modules in programming languages; Object Oriented Language paradigm, Functional and logic language paradigms. Pre- requisite: CSC 201 or CSC 202.",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 62,
        "name": "Database Management Systems and Design II",
        "code": "CIT 401",
        "outline": "Goals of DBMS; Database system models: Relational, Hierarchical, network, Temporal, Object-oriented, Deductive models; Data modelling: Data dependencies, Normal forms, Data decomposition, Schema refinements; Relational calculus; Relational algebra; Query languages; File organization and indexing: Tree structured indexing, hash-based indexing; Concurrency control; Data integrity and security: Data protection; Database system failures and recovery; Data warehousing and mining; Advanced database management systems; Database systems design automation; Advanced Query Languages; Intelligent Query Processing; Very Large Databases; Data Mining and Information Retrieval; High Dimensional Database Accesses: KDB-tree, R* tree, AB-tree, Feature Vectors and Image Databases; Multimedia indexing; Web Databases and Search Engines; Security Issues; Case studies and projects.",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 63,
        "name": "Computer Hardware Systems Design",
        "code": "CSC 403",
        "outline": "Computer circuits: diode arrays, programmable logic arrays, etc. Computer major integrated circuits; Fabrication process of SSI, MSI, LSI VLSI and WSI circuits. ALU circuits design; Control unit circuit design; Design and characterization of magnetic disks and tapes; optical disks; Design of semi- conductor memories; Flash memories; Design features of peripheral devices: CRTs, keyboards, mouse, light pens, printers, scanners; Character recognition devices; I\/O interface\/control circuits design; Analog-to-Digital and Digital- to-Analog converters; Operational amplifiers, Hardware diagnostic tools. Pre-requisite: CSC 301 or CSC 302.",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 64,
        "name": "Algorithm and Complexity Analysis",
        "code": "CSC 405",
        "outline": "Basic algorithmic analysis: Asymptotic analysis of upper and average complexity bounds; Standard Complexity Classes; Time and Space tradeoffs in algorithm analysis; Recursive Algorithms; Algorithms for unordered and ordered sets, graphs, matrices (with the semi-ring paradigm), bit vectors. Algorithms for integer arithmetic, real arithmetic, polynomial arithmetic, random numbers, matrix operations. Algorithms for text processors, language processors, operating systems, database management. Algorithms for natural language processing (concordances, context-free parsers), robotics (vision, manipulator operation), theorem proving and problem solving (decision methods, search heuristics). Divide and conquer. Solution of recurrence equations. Dynamic programming. Pre-requisite: CSC 305.",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 65,
        "name": "Computer and Society",
        "code": "CSC 407",
        "outline": "Computing as a profession; Types of organizations affected by computers, Sociological impact of computers; Individuals and computers; Computers as auditing tools; Computers in Banking, Education, Government, Insurance, Medical profession, Consultancy services, Telecommunications, etc; Computers and the law of information technology; Computer Attacks and Cyber Terrorism; Contemporary health issues in Computing Profession and Environment: Health Hazards, Ergonomics, Protection and Remedies; A term paper is required on any of the topics; Experts are expected to be invited to speak on the above topics.",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 66,
        "name": "Human Computer Interface Design",
        "code": "CSC 409",
        "outline": "Foundations of HCI: Understanding and Conceptualizing Interaction, Understanding Users, Designing for Collaboration and Communication, Affective Aspect, Interfaces and Interactions, Data Gathering, Data Analysis, Interpretation and Presentation; Principles of GUI: Process of Interaction Design, Identifying Needs and Establishing Requirements, Design, Prototype and Construction; GUI toolkits; Human-centred software evaluation and development; Software Tools for Modelling GUI; Data Structures for Coding Complex GUI Systems; GUI design, evaluation and programming Projects.",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 67,
        "name": "Computer Applications in Operation Research",
        "code": "CSC 411",
        "outline": "Nature and scope of operations research, Linear Programming and graphical methods, Sensitivity analysis: Duality Theory; Transportation and Assignment Problems; Network Analysis: CPM and PERT; Stochastic processes and Markov chains; Inventory Control Theory and Applications; Sequencing and Scheduling Problems: Decision Theory: Decision under Uncertainty; Decision-Iree Models, Investment Appraisal, Resource Allocation; Equipment Replacement Analysis; Reliability of Series\/Parallel systems; Time Series Analysis and Forecasting; Game Theory and Applications; Dynamic Programming Problems, Use of Operations Research Application Packages, Case studies and Simulation;",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 68,
        "name": "Mobile Computing System Design",
        "code": "CSC 415",
        "outline": "Wireless Communication Protocols and of Mobile Computing; Mobile Applications; Mobile Hardware Systems and Infrastructures; Mobile Software Systems, Android technology; Models of Mobile Computing Systems; Cloud Computing; Mobile Computing Programming Systems; Design and Implementation of Mobile Computing Systems;",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 69,
        "name": "Research Methodology & Capstone Management",
        "code": "IFT 405",
        "outline": "The following topics should be covered: Definition of research, scope of research characteristics of research, how to select research topics, planning far research, methods of data collection, instruments used in collection, instruments used in collecting information; sampling procedures, research design and the nature of the research. Methods of analyzing data and hypothesis testing; illustrative examples. Guidelines for writing the research report, report proposal and format for the completed project. Capstone Management, Integration of previously learned knowledge and skills in development, design, and presentation of a project in their professional area say, IT): project plan and justification, develop marketing strategy, design work to satisfy performance, schedule and budget requirement; adjust for unplanned occurrence, and provision of status report. Emphasis should be laid on various chapters of our project report format.",
        "mandatory": 1,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 70,
        "name": "Embedded Systems and Firmware Design",
        "code": "CSC 417",
        "outline": "Microprogrammed Architectures; Principles pf Firmware Engineering; Real- time and Embedded System Concepts; ROM Programming; ROM size reduction techniques; Programmable Logic Arrays; Field Programmable Gate Arrays; (FPGAs); PROM\/EPROM Programmers; Microprocessor-based systems Design; Micro-controllers; Wireless Modem: Hardware Design using Hardware Description Languages (HDLs); Real-time Operating Systems; Systems on a Chip; System Testing and fault Detection; Embedded network Devices; Virtual Machine Approach to System Design; introduction to Real- time Programming Languages; Case Studies and Design projects. Pre-requisite: CSC301 or CSC302.",
        "mandatory": 0,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 71,
        "name": "Compiler Construction II",
        "code": "CSC 419",
        "outline": "Grammars and Languages; Recognizers; Top-down and Bottom-up Parsers; Runtime Storage organization; Use of Display in Runtime Storage Organization; LR Grammars and Analyzers; Construction of LR Tables; Organization of Symbol Table; Storage allocation to run-time variables; Optimization Techniques; Code Generation.",
        "mandatory": 0,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 72,
        "name": "Database Systems Programming",
        "code": "CSC 421",
        "outline": "Review of Database Development Processes; Enterprise Modelling; Conceptual Data Modelling; Logical Database Design; Physical database Design; Database Implementation and Maintenance; Record Structure and File Organization for Relational, Distributed, Object-oriented, Multimedia, Deductive, and Temporal Databases; Design of User-Interface, I\/O and Report Formats; Standard Query Languages (e.g. SQL, QBE, etc); Design and Implementation of Algorithms for Transactions Files Processing and Reports Generation; Automated Program and Report Generators; Detailed Study of a DBMS such as MS-Access, MySQL, Oracle, Sybase, DB2, IMS, etc; Mini-projects on database system design and development. Pre-requisite: CSC403",
        "mandatory": 0,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 73,
        "name": "Concurrent System Programming",
        "code": "CSC 423",
        "outline": "Concurrent Systems Concepts; ACID Properties of Concurrent Transactions; Process Structuring; multi-threaded Processes; Co-routines; Inter-process Communications: Process Address Space; Pipelines; Asynchronous and Synchronous Message Passing; Deadlock and Prevention Algorithms; Resource Allocation Graph and Matrices; Concurrency Control Strategies: Mutual Exclusion; Semaphores; Conditional Critical regions; Monitors; Time-stamp Ordering; Two-phase Locking; Guided Commands; Crashes and Recovery Strategies; Concurrent Programming languages: Constructs; Object Models; Shared Monitors; Concurrent Execution Conditions: Task Serialization; Serialization Graph; Non-strict Execution Schedules; Features of Concurrent Programming Languages (e.g. Concurrent Pascal, concurrent-C, Modula, Turing Plus, Gypsy, PLISTS, etc); Operating System Support for Concurrent Program Development and User-thread Management; Case studies and projects.",
        "mandatory": 0,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 74,
        "name": "Numerical Computations",
        "code": "CSC 413",
        "outline": "Matrix types and computations; Solution of linear and nonlinear systems of equatiams, Eigenvalue\/eigenvector problems; Vector algebra: Numerical solution of ordinary and partial differential equations: Numerical interpolations; Function approximations: Spline functions Chebyshev functions, Stability and convergence analysis, Truncation error analysis: Numerical approximations: Fourier transforma, wavelet transforms Multi-dimensional numerical interpolation; Matrix\/vector computations: Eigenfunctions, singular value decomposition; Numerical solution of some linear\/nonlinear ODEs and PDEs; Numerical optimization methods; Advanced analytical methods and algorithms applied to solving problems in signal quantization, image processing, optical processing, surface modelling, linear\/nonlinear control Introduction to mathematical software such as Matlab, Mathematica, MathCAD, Maple; Projects on numerical computations with applications to image processing, data analysis and scientific modelling.",
        "mandatory": 0,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 75,
        "name": "Design and Analysis of Experiments I",
        "code": "STA 451",
        "outline": "Basic principles of experimentation. Randomization, replication mid blocking. Local control. Basic designs: completely randomized blocks, split plot, Missing values. Relative efficiency. Estimation and test of variance components. Multiple comparisons. Departures from underlying assumptions. Applications to agriculture, biology and industry. Pre-requisite: STA 211 or STA 212",
        "mandatory": 0,
        "reference_id": 401,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "400",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 76,
        "name": "Student Industrial Attachment",
        "code": "SIW 400",
        "outline": "SIWES 6 Months Student Industrial Attachment",
        "mandatory": 1,
        "reference_id": 402,
        "semester": "RAIN",
        "status": "active",
        "level": "400",
        "has_practical": false,
        "units": 6,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 77,
        "name": "Software Engineering",
        "code": "CSC 501",
        "outline": "Software development process models; Requirements and specifications; Design methodologies: Objected-oriented, Component-based, knowledge- based, Experimental, Agent-based, Formal methods, Prototyping, etc; Data, process and flow design methodologies; Software metrics; Testing and quality assurance; Software test automation; Software maintenance; IEEE and other software standards; SE project management; CASE tools; Case studies and software design mini-projects for planning, control, communication, embedded systems, Internet, and agent-based applications, etc. Prerequisite: CIT201 or CSC204",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 78,
        "name": "Information Systems Management",
        "code": "CSC 503",
        "outline": "Organizational Structures, Leadership Management Functions: Planning, Decision, Control and Motivation, Structure and organization of information systems: Components of information systems: Hardware, Software, and Staff structure; Management policies and functions; Integrated enterprise information system design; Information control; System specifications and design Enterprise Decision Support Systems: Resource Planning System (ERP) software such as SAP R\/3 application development software suite. Information processing modes: Batch, Online, Real-time; File processing and report generation; Backup subsystem; Hardware\/software failures and recovery strategies; Legal issues: Copyright and intellectual property laws. Computer installation management; OEM and Vendors; Managing IT: Enterprise and global management, planning and implementing change, security issues, ethical challenges. Effective corporate placement of EDP and EDP personnel administration; Scheduling operations; Technology of Database management; Planning a new installation; Site preparation; Evaluation of computer department; Management personnel; EDP management in multinational company; Systems auditing; Managerial Stress. Case studies involving Ecommerce systems development using electronic data interchange (EDI) software.",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 79,
        "name": "Algorithmic Techniques for Smart Systems",
        "code": "CSC 505",
        "outline": "Background: Al and Agents; Al definition and areas, Agent definition, structure and types. Search: Exhaustive search, Heuristic search, Local search (e.g., hill-climbing), ConstRAINt satisfaction, Adversarial search, Search under uncertainty. Logical Reasoning: Knowledge-based systems, Reasoning, Planning, Fuzzy logic. Probalistic Reasoning: Qualifying uncertainty, Bayesian networks, Dynamic Bayesian networks.",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 80,
        "name": "Data Communication Systems",
        "code": "CSC 507",
        "outline": "Introduction to information theory: sources, measures, entropy, coding techniques; Introduction to waves analysis: Fourier series, Fourier transform; Z-transform; Analog\/Digital data conversion; Data communication infra- structures; The OSI model, Data communication equipment; Modems, Hubs, Bridges, and their characteristics; Transmission channels; Synchronous and asynchronous transmission; Packet-switching data networks; Multiplexing (FDM, TDM, PCM), Error detection and correction: Internet protocols; Internet protocol addressing; Internet virtual private networks; Router and routing algorithms: Shortest path routing; distance vector routing, Multi-protocol label switching; Asynchronous transfer mode (ATM) network structure; Wireless LANs; Features of typical data communication software systems.",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 81,
        "name": "Net-Centric Computing and Data Security",
        "code": "CSC 509",
        "outline": "Network System Models; Distributed Computing; Mobile and Wireless Computing; International standard for Internet-based systems Network Database Design and Organization; Network Servers, Client\/Server Computing using the Web; System hosting; Network Security measures; Web programming languages; Web database designs; media technologies; Search engines design; dato security; Tools for design, Modelling, simulation testing, and validation of internet-bosed systems Building Web Applications;",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 82,
        "name": "Artificial Intelligence",
        "code": "CSC 511",
        "outline": "Basic definitions: Data, knowledge, intelligence, artificial intelligence, Tree- structure representation of data\/knowledge and Intelligent search methods, Basic Structure of knowledge-based system; Knowledge Engineering: Knowledge acquisition, knowledge representation schemes, inference mechanisms, Explanation facilities; Introduction to subfields of Al: Expert systems technology, Fuzzy Systems, Machine learning, Genetic algorithms, Genetic programming, Symbolic Logic and Automated Reasoning, Neural networks, Approximate reasoning systern, Game playing; Robots and Vision Systems; Al programming languages and systems: Lisp, Prolog, Smalltalk, Expert system shells; New trends; Applications and case studies",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 83,
        "name": "Data Mining & Big Data Analysis",
        "code": "CSC 513",
        "outline": "Overview of Data Mining; Data warehousing and OLAP; Big Data; Data Pre- processing; Data Cube Computation and Multi-dimensional Data Analysis: Mining Frequent Patterns, Associations, and Correlations; Data Classification: Data Partition Methods (e.g. k-means, hierarchical method; Density-based Method, etc); Data Mining Algorithm (e.g. Data Clustering, Classification, Prediction, etc); Databases for Data Mining Software Benchmarking; Data Mining Software Tools and Applications (e.g. WEKA); Data Mining Mini- Projects for Knowledge Discovery. Pre-requisites: CSC 421",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 84,
        "name": "Final Year Project",
        "code": "CSC 555",
        "outline": "Each final-year student is expected to undertake a computer science related project. The project is to start within the first four (4) weeks of the HARMATTAN Semester of the student's final year. Each student will be assigned to a project supervisor A formal report must be submitted before the second semester examinations begin. The student is required to defend his\/her project before the Depornment and External Examiner.",
        "mandatory": 1,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 85,
        "name": "Microprocessor Architecture",
        "code": "CSC 515",
        "outline": "Formal specifications of microprocessor functions, operations, and architecture; Comparison of current micro-processors: multi-chip; I\/O organization; Assembler language; Comparison of instruction sets; address modes, stack operation subroutines; I\/O data transfer; bus control, daisy chaining, handshaking etc; interrupt structures; program transfer, DMA for microcomputers, types of microprocessors; uses of microprocessor, micro- computer design for specific applications; micro-computer networking; interfacing micro-computer real time control; laboratory exercises.",
        "mandatory": 0,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 86,
        "name": "Distributed Computer Systems Design",
        "code": "CSC 517",
        "outline": "Classification of Distributed Systems; Distributed System Models; Communication Protocols; Remote Access Control; Remote Method Invocation: Stream-oriented Communication Synchronization, Global Stode, Election, Distributed Mutual Exclusion, Distributed Database Design, Diantsution Tromparency, Commit Protocol and Concurrency Control; Tac and Three-phase Commit: Query Processing Distributed Transactions Noming: Genenc Schemes, Domain Naming Schemes Naming and Localization, Replication and Coherence; Consistency Models and Protocols, Fault tolerance, Group Communications, Check Points: Security Access Control, Key Management: Data Encryption: Distributed Operating Systems; Datributed File System and Services: NFS, Coda, etc. Mobile Computing; Dapibuted System and Network Programming.",
        "mandatory": 0,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 87,
        "name": "Special Topics in Information Technology",
        "code": "CSC 519",
        "outline": "Web Server Administration, Web Development using Content Management Systems, Computer Forensics, computer Auditing, Information Technology Project Development and Management, Architecture and Organization of Enterprise Information System; Computer Network Administration, Multimedia Systems, Teleconferencing, Smart IT Devices\/Tools. Information Security Risks, Analysis and Management, Information Disaster Recovery",
        "mandatory": 0,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 88,
        "name": "Organization of Programming Languages",
        "code": "CSC 521",
        "outline": "Classification of High-level Programming Languages; Language Definition Structure, Data Types and Structuring: Review of Basic Data Types including Lists and Trees, Control Structure and Data flows; Runtime Considerations; Interpretative Languages, Lexical Analysis and Parsing. Language design Project",
        "mandatory": 0,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 89,
        "name": "Sampling Theory and Survey Methods II",
        "code": "STA 513",
        "outline": "Ratio, Regression and Difference estimation procedures. Double sampling. Interpenetrating scheme. Multiphase and multistage sampling. Cluster sampling with unequal sizes; problem of optimal allocation with more than one item. Further stratified sampling.",
        "mandatory": 0,
        "reference_id": 501,
        "semester": "HARMATTAN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 90,
        "name": "Formal Models of Computation",
        "code": "CSC 502",
        "outline": "Review of formal grammar and languages; classification of grammars; Deterministic and Non-deterministic Automata; Regular set and Regular Expressions. Closure properties; Parsing; Sequential machines and finite state transducers. State minimization; Pushdown automata; Pushdown transducer; Turning machine as acceptor and transducer; Universal Turing machine; Church Thesis; Solvability and Solvability; Computable and Non-computable functions; Recursive functions. Halting problem; Relative Power of Formal Models; Abstract machine models design and software simulation exercises. Prerequisite: CSC312.",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 91,
        "name": "Computer Graphics and Visualization",
        "code": "CSC 504",
        "outline": "Operating modes. The light pen. Display control, converters, symbol generators, Line generators. Amplifiers. Cathode Ray Tube. CRT recorders. Direct-view storage tube. Automatic Mechanical plotting Boards. Interactive graphics display software. Three-dimensional rotation. Translation and perspective transformations. Hidden-line removal. Representation of three dimensional objects, reticular surfaces, coons' patches, B-splines. State-of- the- art application in design, controls and engineering analysis. Computer graphics Colour Management; Computer graphics programming languages; Use of advanced graphics libraries (e.g. OpenGL and\/or DirectX) for the implementation of the different concepts; Image types, storage, and retrieval algorithms; Images from scanners and digital cameras; Photo manipulation; Optimizing images. Image compression and decompression; Software (e.g. Adobe Photoshop Elements) for image creation and image database management.",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 92,
        "name": "Computer Networks and Communications",
        "code": "CSC 506",
        "outline": "Network concepts: Network structures, architectures and protocols. Storage, delay, multiplexing, bandwidth sharing and dynamic bandwidth management, QoS. Channel organization, framing, channel access control. PSPDN and integrated digital networks; Open System Interconnection (OSI) and transmission control Protocol\/Internet Protocol (TCP\/IP). Network Topologies- LANS, WANs, Terminal Networks, Broadcast and Routed transmission. LAN contention and permission based Media Access Protocol, CSMA\/CD. Token ring. Token Bus, Slatted ring, Client\/Server models, RPC, FDDI, WAN-Circuit, Message and packet switching, PSDN and ISDN, X25. Routing algorithms. Internetworking: resolution of protocol variations. Repeaters, Hub, Bridges, Routers, Routers, gateways, protocol converters. Information to internet. TCP\/ IP-core Internet technology. Internet connectivity. Services on the Internet. Current trends on the internet. Network performance evaluation; Network modelling and simulation projects.",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 93,
        "name": "System Performance Evaluation",
        "code": "CSC 508",
        "outline": "Evaluation as disciplined enquiry; An overview of models and conceptualization: A historical overview; Planning alternative approaches to evaluation; assumptions underlying evaluation models and conceptualizations; Design standards; Influence of models on information systems; Impact of model building process; Applications of the Discrepancy Model: CIPP, Stake Countenance, Scriven, Provus, Kammond, Alkin, Tyler, Stufflebeam; Basic techniques of system performance evaluation: specific topics include performance modelling, discrete events simulation, verification and validation of simulation models, analysis of simulation output. Analysis of single-server queue and queuing networks; modelling of computer systems. Case studies of some real systems and models",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 94,
        "name": "Computer Modeling and Simulation",
        "code": "CSC 510",
        "outline": "Review of probability and decision-making under uncertainty; maximum and minimum regret rules; decision trees; forecasting regression analysis and times series analysis; queuing models; inventory and scheduling systems; times flow mechanisms; Mathematical models of computer I\/O hardware. device using mass-spring-dashpot analogues; Design of simulation program; analysis of results of simulation: validation of simulation models and results; introduction to simulation language (e.g. SIMULA, QSB+); case studies of computer modelling, simulation and forecasting in scientific, business and industrial applications.",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 95,
        "name": "Special Topics in Software Engineering",
        "code": "CSC 514",
        "outline": "SPECIAL TOPICS IN SOFTWARE ENGINEERING (201) Topics from process improvement; software re-engineering configuration management; Formal specification, software cost estimation, Software architecture, Software patters, Software Reuse and Open source development",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 96,
        "name": "The Internet of Things",
        "code": "CSC 512",
        "outline": "General overview of internet of things (IoT). Cloud technology: Cloud Computing and Architecture, IoT Architecture, Planning an Architecture of IoT, Understanding IoT Protocols. Markets\/Financial: understanding lot as applied in Business, Business tools, IoT Business Models & benefits, Issues of IoT in Business. Blockchain Technology: understanding the Cryptocurrency technologies e.g BitCoin, Etherium, liteCoins, Benefits and challenges, etc. Security: loT Device Security Mechanism, Flexibility level of protection required for the loT, Challenges of securing IoT Communication. Privacy & User: Data & privacy, Big Data. Education: Educational Enhanced Learning - various E-learning tools (Course Management System, Game-bosed learning, Online Management System, Result processing system, etc), Design\/ User Experience: Designing for predictive Machine Learning for the loT, How to design successful IoT Products, User Experience Design for predictive Mechanism for the IoT. Other IoT Applications. Course minor project.",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 2,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 97,
        "name": "Final Year Project",
        "code": "CSC 556",
        "outline": "Each final-year student is expected to undertake a computer science related project. The project is to start within the first four (4) weeks of the RAIN Semester of the student's final year. Each student will be assigned to a project supervisor A formal report must be submitted before the second semester examinations begin. The student is required to defend his\/her project before the Depornment and External Examiner.",
        "mandatory": 1,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 98,
        "name": "Cryptography Algorithms and Applications",
        "code": "CSC 516",
        "outline": "Overview and Introduction to Cryptography, Mathematical Background, Symmetric Cryptosystems, Stream Ciphers, Block Ciphers, Feistel Ciphers, Multiple Encryption, DES\/AES, Hash Functions, Data Integrity, Authentication, MAC, Asymmetric Cryptosystems, Number Theory Background, Algorithmic Number theory, Probabilistic Primality Testing, True Primality Testing, Factoring Integers, RSA, Security of RSA Encryption, Security of RSA Key Generation, Discrete Logarithm Cryptographic Schemes, Diffe-Hellman, ElGamal, Key Establishment, Identification Protocols, Digital Signatures, Public Key Management, ECC, Quantum Cryptography, Visual Cryptography, Lattice Cryptography.",
        "mandatory": 0,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": true,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    },
    {
        "id": 99,
        "name": "Decision Theory",
        "code": "STA 502",
        "outline": "Empirical sources of knowledge - hypothesis, observation and experiment. Deductive sources of knowledge and scientific attitude. The concept of causation. Probability, a brief historical treatment to show conflicting definitions. Bayesian statistical methods in science. Principles of decision making. Utility functions and their properties. Role of uncertainty. Raves Strategies. Problems of prior and posterior distributions: value of prior information. Minimax strategies, Statistical inference. Theory of games.",
        "mandatory": 0,
        "reference_id": 502,
        "semester": "RAIN",
        "status": "active",
        "level": "500",
        "has_practical": false,
        "units": 3,
        "prerequisite": 0,
        "image": null,
        "created_at": "2024-03-03 05:00:48",
        "updated_at": "2024-03-03 05:00:48"
    }
]